#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lujop/catinfosalut/runs/run-SHQCe8yc8uKU9qSz

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
aws_apigatewayv2_api.CatInfoSalutAPI: Refreshing state... [id=dkkmlqukgk]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_apigatewayv2_stage.defaultStage: Refreshing state... [id=$default]
aws_lambda_function.catinfosalut: Refreshing state... [id=hello_function]
aws_apigatewayv2_integration.integration: Refreshing state... [id=mvd67v3]
aws_lambda_permission.api_gateway_catinfosalut: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_route.default_route: Refreshing state... [id=emfjqjd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_exec_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_exec_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_lambda_function.catinfosalut will be updated in-place
  ~ resource "aws_lambda_function" "catinfosalut" {
        id                             = "hello_function"
      ~ last_modified                  = "2022-06-25T11:22:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "wF7Zu2VmiCV2j15Y0YDfT5sG2rWu0mc+hg1wXkYdiBY=" -> "/3QZ0WLUmCTOZbADE9ObL22UG2nxnrNi7gnuo/aV8UY="
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "telegram_token"          = "telegram_token"
                # (1 unchanged element hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.telegram_token will be created
  + resource "aws_ssm_parameter" "telegram_token" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "telegram_token"
      + tags_all  = (known after apply)
      + tier      = (known after apply)
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @lujop, Action: `pull_request`, Working Directory: ``, Workflow: `Main workflow on push`*